# Pandas-DataFrame and Series
    1.data analysis and data cleaning 
    2.Provide two type of data structure 
        1.Series --> 1D array object
        2.DataFrame --> 2D

In [1]:
!pip install pandas

Requirement already satisfied: pandas in d:\ml\code\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in d:\ml\code\venv\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\ml\code\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\ml\code\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in d:\ml\code\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in d:\ml\code\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [9]:
import pandas as pd

In [3]:
# Series 
# --> 1D array that can hold any data type 
# similar to column table 
data=[1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
## Create a Series form dictionary element 
data = {'a':1,'b':2,'c':3}
series_dic = pd.Series(data)
print(series_dic)

a    1
b    2
c    3
dtype: int64

In [10]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index = index)

a    10
b    20
c    30
dtype: int64

In [20]:
## Data Frame --> having multiple rows and columns 
# 2D mutable 
# Create a dataframe form dic of list 
data={
    'name':['Krish','omkar','om'],
    'Age' :[23,22,45],
    'City' : ["barily",'Satara','pune']
}
df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    name  Age    City
0  Krish   23  barily
1  omkar   22  Satara
2     om   45    pune

In [21]:
import numpy as np
np.array(df)

array([['Krish', 23, 'barily'],
       ['omkar', 22, 'Satara'],
       ['om', 45, 'pune']], dtype=object)

In [22]:
# Create a DataFrame from list of dic 
data = [
    {'name':'krish','age':23,'city':'pune'},
    {'name':'omkar','age':20,'city':'beed'},
    {'name':'rajiv','age':22,'city':'loni'},
] 
df = pd.DataFrame(data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [24]:
df = pd.read_csv('Payment.csv')
df.head(5)

,Timestamp,Name,Registration No.,Transaction ID,Amount:,Paid To:,Room No:,Bank Name,Email address
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,9/15/2024 22:11:18,likhit sharma,24bce10112,425900980984,151.0,deb,332,bank of baroda,likhit.24bce10112@vitbhopal.ac.in
2,9/15/2024 22:14:20,Nirvan shashi singh,23BAI11030,462538384105,151.0,Debjyoti mitra,A-347,Icici,nirvan.23bai11030@vitbhopal.ac.in
3,9/15/2024 22:20:44,Eshant Baranwal,24BCY10212,425920871395,151.0,Debjyoti mitra,A-346,Bank of Baroda,eshant.24bcy10212@vitbhopal.ac.in
4,9/15/2024 22:21:13,Shubhankan Kumar,24bce11144,425970282360,200.0,Deb,A337,Hdfc bank,shubhankan.24bce11144@vitbhopal.ac.in

In [25]:
df.tail(5)

,Timestamp,Name,Registration No.,Transaction ID,Amount:,Paid To:,Room No:,Bank Name,Email address
10,9/15/2024 22:40:20,Priyanshu gupta,24BCY10320,462578885237,151.0,Dev jyoti,A332,Punjab National Bank,priyanshu.24bcy10320@vitbhopal.ac.in
11,9/15/2024 22:45:47,PRATYUSH RAKECHA,24BCE10769,425954841248,151.0,Debjyoti mitra,A 352D,SBI,pratyush.24bce10769@vitbhopal.ac.in
12,9/15/2024 22:45:55,Devesh Agarwal,24BAI10908,425954590514,151.0,Debjyoti,A342,Bank of India,devesh.24bai10908@vitbhopal.ac.in
13,9/15/2024 22:54:13,Hemendra Singh,23BAI11347,462567672143,151.0,Debjyoti Mitra,Block 1 A 324,Indian Bank,hemendra.23bai11347@vitbhopal.ac.in
14,9/15/2024 22:59:17,SHIVANCHAL YADAV,24BCE10217,425968460036,151.0,Debjyoti,325,Canara,shivanchal.24bce10217@vitbhopal.ac.in

In [26]:
## Access data from dataframe 
data

[{'name': 'krish', 'age': 23, 'city': 'pune'},
 {'name': 'omkar', 'age': 20, 'city': 'beed'},
 {'name': 'rajiv', 'age': 22, 'city': 'loni'}]

In [27]:
df

,Timestamp,Name,Registration No.,Transaction ID,Amount:,Paid To:,Room No:,Bank Name,Email address
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,9/15/2024 22:11:18,likhit sharma,24bce10112,425900980984,151.0,deb,332,bank of baroda,likhit.24bce10112@vitbhopal.ac.in
2,9/15/2024 22:14:20,Nirvan shashi singh,23BAI11030,462538384105,151.0,Debjyoti mitra,A-347,Icici,nirvan.23bai11030@vitbhopal.ac.in
3,9/15/2024 22:20:44,Eshant Baranwal,24BCY10212,425920871395,151.0,Debjyoti mitra,A-346,Bank of Baroda,eshant.24bcy10212@vitbhopal.ac.in
4,9/15/2024 22:21:13,Shubhankan Kumar,24bce11144,425970282360,200.0,Deb,A337,Hdfc bank,shubhankan.24bce11144@vitbhopal.ac.in
5,9/15/2024 22:25:52,Mayank,24BAC10071,425950114634,151.0,Debjyoti,A-346,NaN,mayank.24bac10071@vitbhopal.ac.in
6,9/15/2024 22:27:29,Sidhant kumar,24BSA10172,425978715469,151.0,Debjyoti,A332,NaN,sidhant.24bsa10172@vitbhopal.ac.in
7,9/15/2024 22:34:38,Kanishk Giri,23BAI11017,425954315831,151.0,Debjyoti,A,debjyoti0800-1@okhdfcbank,kanishk.23bai11017@vitbhopal.ac.in
8,9/15/2024 22:35:59,Ayush Prajapati,23BCG10110,T2409152235309579102275,151.0,Debjyoti,352-A,HDFC,ayush.23bcg10110@vitbhopal.ac.in
9,9/15/2024 22:37:28,Sejal Srivastava,23BAI10851,T2409152230115245144655,151.0,Debjyoti,G22,Hdfc,sejal.23bai10851@vitbhopal.ac.in
10,9/15/2024 22:40:20,Priyanshu gupta,24BCY10320,462578885237,151.0,Dev jyoti,A332,Punjab National Bank,priyanshu.24bcy10320@vitbhopal.ac.in
11,9/15/2024 22:45:47,PRATYUSH RAKECHA,24BCE10769,425954841248,151.0,Debjyoti mitra,A 352D,SBI,pratyush.24bce10769@vitbhopal.ac.in
12,9/15/2024 22:45:55,Devesh Agarwal,24BAI10908,425954590514,151.0,Debjyoti,A342,Bank of India,devesh.24bai10908@vitbhopal.ac.in
13,9/15/2024 22:54:13,Hemendra Singh,23BAI11347,462567672143,151.0,Debjyoti Mitra,Block 1 A 324,Indian Bank,hemendra.23bai11347@vitbhopal.ac.in
14,9/15/2024 22:59:17,SHIVANCHAL YADAV,24BCE10217,425968460036,151.0,Debjyoti,325,Canara,shivanchal.24bce10217@vitbhopal.ac.in

In [28]:
df = pd.DataFrame(data)
df

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [30]:
type(df['name'])

pandas.core.series.Series

In [31]:
df['name']

0    krish
1    omkar
2    rajiv
Name: name, dtype: object

In [32]:
df.loc[0]

name    krish
age        23
city     pune
Name: 0, dtype: object

In [33]:
df.iloc[0]

name    krish
age        23
city     pune
Name: 0, dtype: object

In [34]:
df.iloc[0][0]

C:\Users\omkar\AppData\Local\Temp\ipykernel_7532\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'krish'

In [36]:
df.iloc[1][0]

C:\Users\omkar\AppData\Local\Temp\ipykernel_7532\1019881219.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][0]

'omkar'

In [37]:
df

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [38]:
df.iloc[0][2]

C:\Users\omkar\AppData\Local\Temp\ipykernel_7532\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'pune'

In [39]:
df.iloc[2][2]

C:\Users\omkar\AppData\Local\Temp\ipykernel_7532\870244984.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[2][2]

'loni'

In [40]:
## Accessing a specified element 
df['name']

0    krish
1    omkar
2    rajiv
Name: name, dtype: object

In [41]:
df

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [45]:
df.at[1,'age']

np.int64(20)

In [46]:
df.at[2,'name']

'rajiv'

In [47]:
## Accessing a specified element using iat
df.iat[2,2]

'loni'

In [48]:
## Data Manipulation With Dataframe
df

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [50]:
# Add new column
df['Salary']=[50000,20000,200000]

In [51]:
df

    name  age  city  Salary
0  krish   23  pune   50000
1  omkar   20  beed   20000
2  rajiv   22  loni  200000

In [52]:
# remove a column
df.drop('Salary',axis=1)

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [53]:
df

    name  age  city  Salary
0  krish   23  pune   50000
1  omkar   20  beed   20000
2  rajiv   22  loni  200000

In [54]:
df.drop('Salary',axis=1,inplace=True)

In [55]:
df

    name  age  city
0  krish   23  pune
1  omkar   20  beed
2  rajiv   22  loni

In [56]:
# Add age to column 
df['age']= df['age']+1

In [57]:
df

    name  age  city
0  krish   24  pune
1  omkar   21  beed
2  rajiv   23  loni

In [59]:
df.drop(0,inplace=True)

In [60]:
df

    name  age  city
1  omkar   21  beed
2  rajiv   23  loni

In [61]:
df = pd.read_csv('Payment.csv')

In [62]:
df

,Timestamp,Name,Registration No.,Transaction ID,Amount:,Paid To:,Room No:,Bank Name,Email address
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,9/15/2024 22:11:18,likhit sharma,24bce10112,425900980984,151.0,deb,332,bank of baroda,likhit.24bce10112@vitbhopal.ac.in
2,9/15/2024 22:14:20,Nirvan shashi singh,23BAI11030,462538384105,151.0,Debjyoti mitra,A-347,Icici,nirvan.23bai11030@vitbhopal.ac.in
3,9/15/2024 22:20:44,Eshant Baranwal,24BCY10212,425920871395,151.0,Debjyoti mitra,A-346,Bank of Baroda,eshant.24bcy10212@vitbhopal.ac.in
4,9/15/2024 22:21:13,Shubhankan Kumar,24bce11144,425970282360,200.0,Deb,A337,Hdfc bank,shubhankan.24bce11144@vitbhopal.ac.in
5,9/15/2024 22:25:52,Mayank,24BAC10071,425950114634,151.0,Debjyoti,A-346,NaN,mayank.24bac10071@vitbhopal.ac.in
6,9/15/2024 22:27:29,Sidhant kumar,24BSA10172,425978715469,151.0,Debjyoti,A332,NaN,sidhant.24bsa10172@vitbhopal.ac.in
7,9/15/2024 22:34:38,Kanishk Giri,23BAI11017,425954315831,151.0,Debjyoti,A,debjyoti0800-1@okhdfcbank,kanishk.23bai11017@vitbhopal.ac.in
8,9/15/2024 22:35:59,Ayush Prajapati,23BCG10110,T2409152235309579102275,151.0,Debjyoti,352-A,HDFC,ayush.23bcg10110@vitbhopal.ac.in
9,9/15/2024 22:37:28,Sejal Srivastava,23BAI10851,T2409152230115245144655,151.0,Debjyoti,G22,Hdfc,sejal.23bai10851@vitbhopal.ac.in
10,9/15/2024 22:40:20,Priyanshu gupta,24BCY10320,462578885237,151.0,Dev jyoti,A332,Punjab National Bank,priyanshu.24bcy10320@vitbhopal.ac.in
11,9/15/2024 22:45:47,PRATYUSH RAKECHA,24BCE10769,425954841248,151.0,Debjyoti mitra,A 352D,SBI,pratyush.24bce10769@vitbhopal.ac.in
12,9/15/2024 22:45:55,Devesh Agarwal,24BAI10908,425954590514,151.0,Debjyoti,A342,Bank of India,devesh.24bai10908@vitbhopal.ac.in
13,9/15/2024 22:54:13,Hemendra Singh,23BAI11347,462567672143,151.0,Debjyoti Mitra,Block 1 A 324,Indian Bank,hemendra.23bai11347@vitbhopal.ac.in
14,9/15/2024 22:59:17,SHIVANCHAL YADAV,24BCE10217,425968460036,151.0,Debjyoti,325,Canara,shivanchal.24bce10217@vitbhopal.ac.in

In [63]:
# Give all Statistical Values 
df.describe()

          Amount:
count   14.000000
mean   154.500000
std     13.095801
min    151.000000
25%    151.000000
50%    151.000000
75%    151.000000
max    200.000000